1. Pada Tugas No. 1 ini kita akan melakukan sedikit manipulasi data set. Data set yang kita manipulasi adalah dataset yang berasal dari data customers dan orders. 

Tujuan akhirnya adalah kita ingin melihat customers dan order yang dia lakukan dalam satu dataset agar selanjutnya lebih mudah dilakukan pengolahan

In [2]:
#import semua library dan package yang dibutuhkan disini
import pandas as pd

In [4]:
#baca dan masukkan data dari setiap berkas ke dalam dataframenya masing-masing
#tampilkan 5 data awal dari setiap dataset dan juga tipe data dari setiap kolomnya
df = pd.read_csv("customers.csv",sep=";")
display(df.head())
display(df.dtypes)
df2 = pd.read_csv("orders.csv", sep=";")
display(df2.head())
display(df2.dtypes)

,userid,lastname,firstname,phone,address,city,country
0,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France
1,112,King,Jean,7025551838,8489 Strong St.,Las Vegas,USA
2,114,Ferguson,Peter,03 9520 4555,636 St Kilda Road,Melbourne,Australia
3,119,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",Nantes,France
4,121,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,Stavern,Norway

userid        int64
lastname     object
firstname    object
phone        object
address      object
city         object
country      object
dtype: object

   ordernumber   orderdate  userid
0        10101  09/01/2003     128
1        10103  29/01/2003     121
2        10104  31/01/2003     141
3        10105  11/02/2003     145
4        10107  24/02/2003     131

ordernumber     int64
orderdate      object
userid          int64
dtype: object

In [5]:
#sekarang kita lakukan join pada dataset kita berdasarkan pada userid. cari data yang memiliki irisan/kesamaan dari kedua dataset
df3 = pd.merge(df,df2,on="userid",how="outer")
df3.head()

,userid,lastname,firstname,phone,address,city,country,ordernumber,orderdate
0,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France,10123.0,20/05/2003
1,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France,10298.0,27/09/2004
2,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France,10345.0,25/11/2004
3,112,King,Jean,7025551838,8489 Strong St.,Las Vegas,USA,10124.0,21/05/2003
4,112,King,Jean,7025551838,8489 Strong St.,Las Vegas,USA,10278.0,06/08/2004

2. Jelaskan dengan sederhana apa yang dimaksud dengan algoritma K-Means pada Unsupervised Learning. 

Jelaskan pula bagaimana cara kerja algoritma tersebut.

Jelaskan dengan bahasa kalian

In [2]:
#isikan jawaban no.2 pada sel ini
K-Means merupakan algoritma pada Unsupervised learning yang bertujuan untuk mengelompokan (clusering) data berdasarkan karakteristik
data yang ada sehingga data-data tersebut dikelompokan dalam kelompok yang memiliki karakteristik yang sama. 

Proses K-Mean Clustering
- handling missing value terlebih dahulu data tersebut 
- handling outlier untuk menghapus outlier dalam data
- melakukan rescaling 
- menentukan nilai n-clusters, dan random state untuk titk awal cluster
-melakukan perhitungan cluster berulang untuk mengoptimakan posisi centroid
- mendapatkan posisi centroid yang diinginkan dalam visual / grafik

bisa juga sebelum melakukan proses clustering kMean, melakukan elbow graph terlebih dahulu untuk mendapatkan nilai n-clusters yang direkomendasikan